# Задача 1. Дано натуральное число N. Напишите метод,
# который вернёт список простых множителей числа N и количество этих множителей.
# 60 -> 2, 2, 3, 5
import math


def prime_factors(num):
    print(f"{num} ->", end=" ")
    while num % 2 == 0:
        print(2, end=" ")
        num = num / 2

    for i in range(3, int(math.sqrt(num)) + 1, 2):

        while num % i == 0:
            print(i, end=" ")
            num = num / i
    if num > 2:
        print(int(num), end=" ")


# Задача 2. В первом списке находится информация об ассортименте мороженного,
# во втором списке - информация о том, какое мороженное есть на складе.
# Выведите названия того товара, который закончился.
#
# Пример:
# 1 строка файла. «Сливочное», «Бурёнка», «Вафелька», «Сладкоежка»
# 2 строка файла. «Сливочное», «Вафелька», «Сладкоежка»
# Ответ. Закончилось: «Бурёнка»

def task():
    ice_list = set(['Сливочное', 'Бурёнка', 'Вафелька', 'Сладкоежка'])
    ice_list_warehouse = set(['Сливочное', 'Вафелька', 'Сладкоежка'])
    print(f"Закончилось: {ice_list.difference(ice_list_warehouse)}")
task()